In [1]:
import pandas as pd
import numpy as np

In [3]:
test=['Sec A','Sec B','Sec C','Sec A','Sec B','Sec C','Sec A','Sec B','Sec C']
ind=['PoU','PoU','PoU','TU','TU','TU','KU','KU','KU']

zip(ind,test)
lst=list(zip(ind,test))
lst

[('PoU', 'Sec A'),
 ('PoU', 'Sec B'),
 ('PoU', 'Sec C'),
 ('TU', 'Sec A'),
 ('TU', 'Sec B'),
 ('TU', 'Sec C'),
 ('KU', 'Sec A'),
 ('KU', 'Sec B'),
 ('KU', 'Sec C')]

In [4]:
test_ind=pd.MultiIndex.from_tuples(lst)
test_ind

MultiIndex([('PoU', 'Sec A'),
            ('PoU', 'Sec B'),
            ('PoU', 'Sec C'),
            ( 'TU', 'Sec A'),
            ( 'TU', 'Sec B'),
            ( 'TU', 'Sec C'),
            ( 'KU', 'Sec A'),
            ( 'KU', 'Sec B'),
            ( 'KU', 'Sec C')],
           )

In [5]:
np.random.seed(101)

df=pd.DataFrame(np.random.randint(35,100,size=(9,3)),index=test_ind,columns=['1st year','2nd year','3rd year'])
df

           1st year  2nd year  3rd year
PoU Sec A        46        98        44
    Sec B        75        39        98
    Sec C        75        95        99
TU  Sec A        40        47        75
    Sec B        84        43        64
    Sec C        94        69        79
KU  Sec A        54        45        35
    Sec B        43        97        71
    Sec C        63        98        42

In [7]:
df[['2nd year']]

           2nd year
PoU Sec A        98
    Sec B        39
    Sec C        95
TU  Sec A        47
    Sec B        43
    Sec C        69
KU  Sec A        45
    Sec B        97
    Sec C        98

In [8]:
df.loc['TU']

       1st year  2nd year  3rd year
Sec A        40        47        75
Sec B        84        43        64
Sec C        94        69        79

In [15]:
df.loc['TU'].loc[['Sec B']]

       1st year  2nd year  3rd year
Sec B        84        43        64

In [14]:
df.loc['TU'].iloc[::-1]

       1st year  2nd year  3rd year
Sec C        94        69        79
Sec B        84        43        64
Sec A        40        47        75

In [17]:
df.index

MultiIndex([('PoU', 'Sec A'),
            ('PoU', 'Sec B'),
            ('PoU', 'Sec C'),
            ( 'TU', 'Sec A'),
            ( 'TU', 'Sec B'),
            ( 'TU', 'Sec C'),
            ( 'KU', 'Sec A'),
            ( 'KU', 'Sec B'),
            ( 'KU', 'Sec C')],
           )

In [19]:
df.index.names=['University','Sections']
df

                     1st year  2nd year  3rd year
University Sections
PoU        Sec A           46        98        44
           Sec B           75        39        98
           Sec C           75        95        99
TU         Sec A           40        47        75
           Sec B           84        43        64
           Sec C           94        69        79
KU         Sec A           54        45        35
           Sec B           43        97        71
           Sec C           63        98        42

In [20]:
df.xs('KU')

          1st year  2nd year  3rd year
Sections
Sec A           54        45        35
Sec B           43        97        71
Sec C           63        98        42

In [22]:
df.xs(('KU','Sec B'))

1st year    43
2nd year    97
3rd year    71
Name: (KU, Sec B), dtype: int32

In [23]:
df.xs(('KU','Sec B'),level=[0,1])

                     1st year  2nd year  3rd year
University Sections
KU         Sec B           43        97        71

In [27]:
df.xs('Sec B',level='Sections')

            1st year  2nd year  3rd year
University
PoU               75        39        98
TU                84        43        64
KU                43        97        71

In [32]:
df.xs('Sec C',level=1)

            1st year  2nd year  3rd year
University
PoU               75        95        99
TU                94        69        79
KU                63        98        42